In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series(data=[10,20,30,40,50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
s2 = pd.Series(data=[100,200,300,400,500])
s2

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [4]:
s3 = pd.Series(data=[1000,2000,3000,4000,5000],index=tuple('ABCDE'))
s3

A    1000
B    2000
C    3000
D    4000
E    5000
dtype: int64

In [5]:
df = pd.DataFrame({'C1':s1, 'C2':s2, 'C3':[11, 22, 33, 44, 55]})
df

   C1   C2  C3
0  10  100  11
1  20  200  22
2  30  300  33
3  40  400  44
4  50  500  55

In [6]:
df = pd.DataFrame(data=np.random.randint(1,100,size=(1000,5)), columns=list('abcde'))       #(start, end, size=(rows, series))
df

      a   b   c   d   e
0    15  28  76  57  73
1    22  51  92  27  74
2    24  45  47  40  11
3    33  21  90  36  29
4     2  53  46  67  20
..   ..  ..  ..  ..  ..
995  96  66  98  51  48
996  72  51  20  17  56
997  75  71  86  67   2
998  28  75   1  52  19
999  17  88  53  26  42

[1000 rows x 5 columns]

In [7]:
dataset = pd.read_csv('/w1_s3\\Session 3\\DATASETS\\DATASETS\\Car.csv')
dataset

    Age  Income  Car
0    28   37000    0
1    27   88000    0
2    28   59000    0
3    32   86000    0
4    33  149000    1
..  ...     ...  ...
95   28   89000    0
96   34   43000    0
97   30   79000    0
98   20   36000    0
99   26   80000    0

[100 rows x 3 columns]

In [8]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     100 non-null    int64
 1   Income  100 non-null    int64
 2   Car     100 non-null    int64
dtypes: int64(3)
memory usage: 2.5 KB

In [9]:
dataset.head()

   Age  Income  Car
0   28   37000    0
1   27   88000    0
2   28   59000    0
3   32   86000    0
4   33  149000    1

In [10]:
dataset.tail()

    Age  Income  Car
95   28   89000    0
96   34   43000    0
97   30   79000    0
98   20   36000    0
99   26   80000    0

In [11]:
dataset.Car.value_counts()              # Tells the total count of the particular value

Car
0    93
1     7
Name: count, dtype: int64

In [12]:
dataset.rename(columns={'Car':'Target'})    # Temporary change the name

    Age  Income  Target
0    28   37000       0
1    27   88000       0
2    28   59000       0
3    32   86000       0
4    33  149000       1
..  ...     ...     ...
95   28   89000       0
96   34   43000       0
97   30   79000       0
98   20   36000       0
99   26   80000       0

[100 rows x 3 columns]

In [13]:
dataset

    Age  Income  Car
0    28   37000    0
1    27   88000    0
2    28   59000    0
3    32   86000    0
4    33  149000    1
..  ...     ...  ...
95   28   89000    0
96   34   43000    0
97   30   79000    0
98   20   36000    0
99   26   80000    0

[100 rows x 3 columns]

In [14]:
dataset.rename(columns={'Car':'Target'},inplace=True)       # Permanently change the name
dataset

    Age  Income  Target
0    28   37000       0
1    27   88000       0
2    28   59000       0
3    32   86000       0
4    33  149000       1
..  ...     ...     ...
95   28   89000       0
96   34   43000       0
97   30   79000       0
98   20   36000       0
99   26   80000       0

[100 rows x 3 columns]

In [15]:
dataset.columns

Index(['Age', 'Income', 'Target'], dtype='object')

In [16]:
dataset[['Age','Target']]

    Age  Target
0    28       0
1    27       0
2    28       0
3    32       0
4    33       1
..  ...     ...
95   28       0
96   34       0
97   30       0
98   20       0
99   26       0

[100 rows x 2 columns]

In [17]:
dataset.loc[50]

Age          20
Income    74000
Target        0
Name: 50, dtype: int64

In [18]:
dataset.loc[50:60]

    Age  Income  Target
50   20   74000       0
51   26   15000       0
52   41   45000       0
53   31   76000       0
54   36   50000       0
55   40   47000       0
56   31   15000       0
57   46   59000       0
58   29   75000       0
59   26   30000       0
60   32  135000       1

In [19]:
dataset[(dataset['Income'] > 100000)]

    Age  Income  Target
4    33  149000       1
38   30  107000       1
60   32  135000       1
69   29  148000       1
72   34  115000       0
73   26  118000       0
83   32  117000       1

In [20]:
import pandas as pd
example = pd.read_csv('/w1_s3\\Session 3\\DATASETS\\DATASETS\\abc.csv')
example

  iteams  price
0      A   70.0
1      B    NaN
2      C   50.0
3      D    NaN
4      E   40.0
5      F   32.0
6      G   45.0
7      H   69.0
8      I    NaN
9      J    NaN

In [21]:
example['price'].notnull()      # returns is the value is null or not in true or false output

0     True
1    False
2     True
3    False
4     True
5     True
6     True
7     True
8    False
9    False
Name: price, dtype: bool

In [22]:
example[example['price'].isnull()]

  iteams  price
1      B    NaN
3      D    NaN
8      I    NaN
9      J    NaN

In [23]:
example['price'].fillna(example['price'].max())             # NAN is filled with max value from the price series temporary

0    70.0
1    70.0
2    50.0
3    70.0
4    40.0
5    32.0
6    45.0
7    69.0
8    70.0
9    70.0
Name: price, dtype: float64

In [24]:
example['price'] = example['price'].fillna(example['price'].std())          # Fill the values using standard deviation
example

  iteams      price
0      A  70.000000
1      B  15.517732
2      C  50.000000
3      D  15.517732
4      E  40.000000
5      F  32.000000
6      G  45.000000
7      H  69.000000
8      I  15.517732
9      J  15.517732

In [25]:
example['price'] = example['price'].fillna(example['price'].min())
example

  iteams      price
0      A  70.000000
1      B  15.517732
2      C  50.000000
3      D  15.517732
4      E  40.000000
5      F  32.000000
6      G  45.000000
7      H  69.000000
8      I  15.517732
9      J  15.517732

In [26]:
example['price'] = example['price'].fillna(example['price'].max())
example

  iteams      price
0      A  70.000000
1      B  15.517732
2      C  50.000000
3      D  15.517732
4      E  40.000000
5      F  32.000000
6      G  45.000000
7      H  69.000000
8      I  15.517732
9      J  15.517732

In [27]:
example['price'] = example['price'].fillna(example['price'].mean())
example

  iteams      price
0      A  70.000000
1      B  15.517732
2      C  50.000000
3      D  15.517732
4      E  40.000000
5      F  32.000000
6      G  45.000000
7      H  69.000000
8      I  15.517732
9      J  15.517732

In [28]:
df.drop(['b'],axis='columns')       # Temporary drop

      a   c   d   e
0    15  76  57  73
1    22  92  27  74
2    24  47  40  11
3    33  90  36  29
4     2  46  67  20
..   ..  ..  ..  ..
995  96  98  51  48
996  72  20  17  56
997  75  86  67   2
998  28   1  52  19
999  17  53  26  42

[1000 rows x 4 columns]

In [29]:
df

      a   b   c   d   e
0    15  28  76  57  73
1    22  51  92  27  74
2    24  45  47  40  11
3    33  21  90  36  29
4     2  53  46  67  20
..   ..  ..  ..  ..  ..
995  96  66  98  51  48
996  72  51  20  17  56
997  75  71  86  67   2
998  28  75   1  52  19
999  17  88  53  26  42

[1000 rows x 5 columns]

In [30]:
df.drop(['b'],axis='columns',inplace=True)      # Permanent
df

      a   c   d   e
0    15  76  57  73
1    22  92  27  74
2    24  47  40  11
3    33  90  36  29
4     2  46  67  20
..   ..  ..  ..  ..
995  96  98  51  48
996  72  20  17  56
997  75  86  67   2
998  28   1  52  19
999  17  53  26  42

[1000 rows x 4 columns]

In [31]:
data1 = pd.DataFrame(data=np.random.randint(1,100,size=(100,4)), columns=list('abcd'))

In [32]:
data2 = pd.DataFrame(data=np.random.randint(1,100,size=(100,3)), columns=list('xyz'))

In [33]:
data1

     a   b   c   d
0   46  33  43  48
1   19  55  34  35
2   54  26  74  43
3   12  29  64  24
4   20  90  38  65
..  ..  ..  ..  ..
95  42  32  50  49
96  96  43  44  96
97  98   2  23  68
98  83  58  32  88
99  35  71  63  91

[100 rows x 4 columns]

In [34]:
data2

     x   y   z
0    9  61  21
1   28  40  13
2   12  76  41
3   54  75  22
4   12   2  55
..  ..  ..  ..
95  69  34  24
96   3  29  50
97  74  81  58
98  85  77  10
99  81  48  11

[100 rows x 3 columns]

In [35]:
data1.append(data2)             # DataFrame doesnt contains append method

AttributeError: 'DataFrame' object has no attribute 'append'

In [ ]:
data3 = pd.DataFrame(data=np.random.randint(1,100,size=(100,3)), columns=list('abc'))

In [ ]:
data4 = pd.DataFrame(data=np.random.randint(1,100,size=(100,3)), columns=list('ayz'))

In [ ]:
data3.merge(data4, on='a')

In [ ]:
11 50 74 data3
11 54 36 data4